[
  {
    "title": "Wildfire Tracker Web Application",
    "imageSrc": "projects/project1.png",
    "description": "Top 40 NASA Project focused on improving wildfire prediction with an 82.35% accurate model combining Convolutional Neural Network and LSTM technologies. We developed a responsive web app utilizing React.js, Next.js, TypeScript for reliability, Mapbox for 3D visualization, Tailwind CSS for UI design, and Vercel for hosting. This work aimed to advance wildfire management in underserved areas with limited connectivity.",
    "skills": ["React",  "Next.js", "TypeScript","Tailwind CSS", "HTML", "Python", "Machine Learning", "LoRaWAN" ],
    "demo": "https://phoenix-aneu.vercel.app/",
    "source": "https://github.com/jbric16/FlameForecast_Project?tab=readme-ov-file#-wildfire-tracker-web-application"
  },
  {
    "title": "Phoenix Eye Website",
    "imageSrc": "projects/project2.png",
    "description": "I designed and programmed the Phoenix Eye project's website, a demo that highlights our wildfire prediction project. This platform provides a glimpse into the project's potential effectiveness and features showcasing machine learning capabilities, simulated customer testimonials, and hypothetical support from partnering companies. The website, stemming from our acclaimed Rocket Hacks initiative, serves as a key informational and engagement tool for underserved communities and stakeholders interested in advanced wildfire management concepts.",
    "skills": ["HTML", "CSS", "JavaScript"],
    "demo": "https://hectorgtz27.github.io/PhoenixEye-Website/",
    "source": "https://github.com/HectorGtz27/PhoenixEye-Website"
  },
  {
    "title": "Video Streaming App",
    "imageSrc": "projects/project3.jpg",
    "description": "In this project, we engineered a real-time video streaming application using C++ and object-oriented programming (OOP). The goal was to capture, process, and transmit live video streams. I used UML diagrams for design and managed source code on GitHub for efficient collaboration with the team. This project offered valuable experience in a dynamic era of on-demand video streaming.",
    "skills": ["C++", "UML", "Github" ,"Object Oriented Programming (OOP)"],
    "demo": "https://github.com/HectorGtz27/VideoStreamingApp",
    "source": "https://github.com/HectorGtz27/VideoStreamingApp"
  },
  {
    "title": "Logistics Optimization in the Suez Canal",
    "imageSrc": "projects/project6.jpg",
    "description": "In this project, we utilized C++ to develop software for better product control and optimized routing through Canal posts. We employed various data structures, including Linked Lists, BSTs, Splay Trees, Heap Trees, Graphs, Hash Tables, and algorithms like Merge Sort and Binary Search to efficiently manage and retrieve data. The project's focus was on collecting and processing extensive data to improve logistics, avoiding bottlenecks, and ensuring timely deliveries through advanced data structures and algorithms.",
    "skills": ["C++", "Data Structures", "Github"],
    "demo": "https://github.com/HectorGtz27/Data-Structures-Course",
    "source": "https://github.com/HectorGtz27/Data-Structures-Course"
  },
  {
    "title": "Items Exchange System: Bridging Suppliers and Buyers",
    "imageSrc": "projects/project8.png",
    "description": "In collaboration with a team of three colleagues we developed an Items Exchange System using C++ and OOP principles. This program connects suppliers and buyers in a user-friendly platform. Suppliers showcase their products, and buyers find the best fit for their needs. I used UML diagrams for design clarity and managed source code through GitHub for efficient collaboration. This project streamlines transactions in a dynamic marketplace.",
    "skills": ["C++", "UML", "Github" ,"Object Oriented Programming (OOP)"],
    "demo": "https://github.com/HectorGtz27/Items-Exchange-System-Simulation",
    "source": "https://github.com/HectorGtz27/Items-Exchange-System-Simulation"
  },
  {
    "title": "Youtube Clone",
    "imageSrc": "projects/youtubepage.png",
    "description": "This project is a comprehensive replication of YouTube, one of the world's most popular video-sharing platforms, designed to demonstrate my proficiency in front-end development. The core of this project was built using HTML and CSS, focusing on creating a responsive and user-friendly interface that closely mimics the original YouTube site. Key features include a dynamic homepage displaying trending videos, a search functionality to explore videos, and individual video playback pages with details and recommended videos. Special attention was paid to the layout, ensuring that elements such as the navigation bar, video thumbnails, and comment sections are accurately represented.",
    "skills": ["HTML", "CSS"],
    "demo": "https://hectorgtz27.github.io/YoutubeClone/",
    "source": "https://github.com/HectorGtz27/YoutubeClone"
  },
  {
    "title": "James Webb Space Telescope Interactive Project",
    "imageSrc": "projects/project9.png",
    "description": "Participated in the NASA Space Apps Challenge 2022 with an innovative project: an immersive video game and accompanying quiz platform highlighting the advanced capabilities of the James Webb Space Telescope. Utilized Python (via Pygame) for game development and harnessed HTML, CSS, and JavaScript for crafting the interactive quiz website.",
    "skills": ["HTML", "CSS", "Python"],
    "demo": "https://2022.spaceappschallenge.org/challenges/2022-challenges/through-the-looking-glass/teams/space-bros-sisters/project",
    "source": "https://2022.spaceappschallenge.org/challenges/2022-challenges/through-the-looking-glass/teams/space-bros-sisters/project"
  },
  {
    "title": "Predictive Analysis of Caloric Intake Patterns",
    "imageSrc": "projects/project5.jpeg",
    "description": "I performed a multi-phase analysis of caloric intake utilizing Python within Google Colab. This analysis encompassed crucial stages such as data understanding, cleaning, and modeling. Leveraging libraries like Pandas, Numpy, and Scikit-learn, I developed predictive models to anticipate future caloric intake patterns based on historical data. This analysis provided valuable insights into potential dietary adjustments and their potential health impacts, contributing to informed decision-making in nutritional choices.",
    "skills": ["Python", "Scikit-learn", "Pandas", "NumPy"],
    "demo": "https://github.com/HectorGtz27/Predictive-Analysis-of-Caloric-Intake-Patterns",
    "source": "https://github.com/HectorGtz27/Predictive-Analysis-of-Caloric-Intake-Patterns"
  },

  {
    "title": "Geographic analysis of SARS-CoV-2 sequences",
    "imageSrc": "projects/project4.jpg",
    "description": "We conducted a collaborative study using R to assess global variations in SARS-CoV-2 genetic sequences. Our hypothesis centered around the idea that regional factors, including climate and geography, play a role in influencing noticeable changes in the original genetic makeup of SARS-CoV-2 observed in various countries.",
    "skills": ["R", "RStudio", "RMarkdown"],
    "demo": "https://rpubs.com/HectorGtz27/1040401",
    "source": "https://github.com/HectorGtz27/Geographic-analysis-of-SARS-CoV-2-sequences"
  },
  {
    "title": "Drop Tower Simulation",
    "imageSrc": "projects/project7.jpg",
    "description": "The drop tower is an attraction often found in amusement parks. Riders enter a gondola at ground level, the gondola rides up a vertical tower, then drops down. The brakes come on to stop the gondola as it approaches the bottom of the course. That way you experience free fall, followed by a sharp deceleration. One of the types of brakes used in these towers are magnetic, and they work based on eddy currents. With the help of the MATLAB language, we were able to simulate the behavior of these rides.",
    "skills": ["MATLAB"],
    "demo": "https://github.com/HectorGtz27/DropTowerSimulation",
    "source": "https://github.com/HectorGtz27/DropTowerSimulation"
  }

]